src/cf/Catalogs/Алгоритмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Алгоритмы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДляВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ПодчиненностьПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПодчиненностьПодразделений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РуководительВышестоящего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительПодчиненного</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньВышестоящего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньВышестоящегоОтПодчиненного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подчиненное</Name>
					<Comment>Подчиненное подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вышестоящее</Name>
					<Comment>Вышестоящее подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СотрудникиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Содержит сотрудников на определенных должностях в структурных единицах.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата, с которой запись о сотруднике считается действительной. </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Comment>Дата, с которой запись о сотруднике считается недействительной. </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Занимаемая сотрудником должность.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВДокументах</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВПереписке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДолжностиПодразделенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ранг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказанОсобыйРанг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТТС_ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерхнийУровень_ТТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Алгоритмы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	
	
// Выполняет код указанного алгоритма.
//
// Параметры:
//  КлючДляВызова - Строка - см. реквизит КлючДляВызова справочника Алгоритмы.
//  Параметры - Произвольный - произвольные параметры для выполнения алгоритма.
//
// Возвращаемое значение:
//  Произвольный - значение, возвращенное вызванным алгоритмом. По умолчанию Неопределено.
//
Функция Вызвать(КлючДляВызова, Параметры = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	ДанныеАлгоритма = ДанныеАлгоритмаПоКлючу(КлючДляВызова);
	Если Не ЗначениеЗаполнено(ДанныеАлгоритма.Ссылка) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Алгорим %1 не существует'"), КлючДляВызова);
	КонецЕсли;
	
	УстановитьБезопасныйРежим(Истина);
	Выполнить(ДанныеАлгоритма.Выражение);
	
	Возврат Результат;
	
КонецФункции

// Обновляет предопределенные алгоритмы.
//
Процедура ЗаполнитьПредопределенные() Экспорт
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("ИмяПредопределенного");
	ТаблицаЭлементов.Колонки.Добавить("КлючДляВызова");
	ТаблицаЭлементов.Колонки.Добавить("Выражение");
	
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "НепосредственныйРуководительПользователя";
	Стр.КлючДляВызова = "НепосредственныйРуководительПользователя";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Пользователь"") Тогда
		|    ВызватьИсключение(
		|        НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Пользователь""""'""));
		|КонецЕсли;
		|
		|Сотрудник = Сотрудники.ОсновнойСотрудникПользователя(
		|	Параметры.Пользователь);
		|Если ЗначениеЗаполнено(Сотрудник) И ТипЗнч(Сотрудник) = Тип(""СправочникСсылка.Сотрудники"") Тогда
		|	Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, ""Подразделение"");
		|Иначе
		|	Подразделение = Неопределено;
		|КонецЕсли;
		|
		|Результат = Справочники.Сотрудники.ПустаяСсылка();
		|Если ЗначениеЗаполнено(Подразделение) Тогда
		|	ПодразделениеРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, ""Родитель"");
		|	РуководительПодразделения = СтруктураПредприятия.РуководительПодразделения(Подразделение);
		|	
		|	Если РуководительПодразделения <> Сотрудник Тогда 
		|		Результат = РуководительПодразделения;
		|	Иначе
		|		Пока ПодразделениеРодитель <> Неопределено Цикл
		|			Подразделение = ПодразделениеРодитель;
		|			ПодразделениеРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, ""Родитель"");
		|			РуководительПодразделения = СтруктураПредприятия.РуководительПодразделения(Подразделение);
		|			Если РуководительПодразделения <> Сотрудник Тогда 
		|				Результат = РуководительПодразделения;
		|				Прервать;
		|			КонецЕсли;
		|		КонецЦикла;	
		|	КонецЕсли;
		|	Результат = РуководительПодразделения;
		|КонецЕсли;";
	
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "НепосредственныйРуководительСотрудника";
	Стр.КлючДляВызова = "НепосредственныйРуководительСотрудника";
	
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Сотрудник"") Тогда
		|    ВызватьИсключение(
		|        НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Сотрудник""""'""));
		|КонецЕсли;
		|
		|Сотрудник = Параметры.Сотрудник;
		|Если ЗначениеЗаполнено(Сотрудник) И ТипЗнч(Сотрудник) = Тип(""СправочникСсылка.Сотрудники"") Тогда
		|	Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, ""Подразделение"");
		|Иначе
		|	Подразделение = Неопределено;
		|КонецЕсли;
		|
		|Результат = Справочники.Сотрудники.ПустаяСсылка();
		|Если ЗначениеЗаполнено(Подразделение) Тогда
		|	ПодразделениеРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, ""Родитель"");
		|	РуководительПодразделения = СтруктураПредприятия.РуководительПодразделения(Подразделение);
		|	
		|	Если РуководительПодразделения <> Сотрудник Тогда 
		|		Результат = РуководительПодразделения;
		|	Иначе
		|		Пока ПодразделениеРодитель <> Неопределено Цикл
		|			Подразделение = ПодразделениеРодитель;
		|			ПодразделениеРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, ""Родитель"");
		|			РуководительПодразделения = СтруктураПредприятия.РуководительПодразделения(Подразделение);
		|			Если РуководительПодразделения <> Сотрудник Тогда 
		|				Результат = РуководительПодразделения;
		|				Прервать;
		|			КонецЕсли;
		|		КонецЦикла;	
		|	КонецЕсли;
		|	Результат = РуководительПодразделения;
		|КонецЕсли;";
	
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "ВсеРуководителиПользователя";
	Стр.КлючДляВызова = "ВсеРуководителиПользователя";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Пользователь"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Пользователь""""'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Запрос = Новый Запрос;
		|Запрос.Текст = 
		|	""ВЫБРАТЬ
		|	|	ПодчиненностьПодразделений.РуководительВышестоящего КАК Руководитель
		|	|ИЗ
		|	|	РегистрСведений.ПодчиненностьПодразделений КАК ПодчиненностьПодразделений
		|	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|	|	ПО ПодчиненностьПодразделений.Подчиненное = Сотрудники.Подразделение
		|	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователей КАК СотрудникиПользователей
		|	|	ПО Сотрудники.Ссылка = СотрудникиПользователей.Сотрудник
		|	|	
		|	|ГДЕ
		|	|	СотрудникиПользователей.Пользователь = &Пользователь
		|	|	И ПодчиненностьПодразделений.РуководительВышестоящего <> СотрудникиПользователей.Сотрудник"";
		|Запрос.УстановитьПараметр(""Пользователь"", Параметры.Пользователь);
		|Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);";
	
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "ВсеРуководителиСотрудника";
	Стр.КлючДляВызова = "ВсеРуководителиСотрудника";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Сотрудник"") Тогда
		|    ВызватьИсключение(
		|        НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Сотрудник""""'""));
		|КонецЕсли;
		|
		|Запрос = Новый Запрос;
		|Запрос.Текст = 
		|	""ВЫБРАТЬ
		|	|	ПодчиненностьПодразделений.РуководительВышестоящего КАК Руководитель
		|	|ИЗ
		|	|	РегистрСведений.ПодчиненностьПодразделений КАК ПодчиненностьПодразделений
		|	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|	|		ПО ПодчиненностьПодразделений.Подчиненное = Сотрудники.Подразделение
		|	|	
		|	|ГДЕ
		|	|	Сотрудники.Ссылка = &Сотрудник
		|	|	И ПодчиненностьПодразделений.РуководительВышестоящего <> &Сотрудник
		|	|УПОРЯДОЧИТЬ ПО
		|	|	ПодчиненностьПодразделений.УровеньВышестоящегоОтПодчиненного"";
		|Запрос.УстановитьПараметр(""Сотрудник"", Параметры.Сотрудник);
		|Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);";
	
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "ВсеПодчиненныеПользователя";
	Стр.КлючДляВызова = "ВсеПодчиненныеПользователя";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Пользователь"") Тогда
		|    ВызватьИсключение(
		|        НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Пользователь""""'""));
		|КонецЕсли;
		|
		|Запрос = Новый Запрос;
		|Запрос.Текст = 
		|	""ВЫБРАТЬ
		|	|	Сотрудники.Ссылка КАК Сотрудник
		|	|ИЗ
		|	|	Справочник.Сотрудники КАК Сотрудники
		|	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодчиненностьПодразделений КАК ПодчиненностьПодразделений
		|	|		ПО Сотрудники.Подразделение = ПодчиненностьПодразделений.Подчиненное
		|	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователей КАК СотрудникиПользователей
		|	|		ПО ПодчиненностьПодразделений.РуководительВышестоящего = СотрудникиПользователей.Сотрудник
		|	|ГДЕ
		|	|	СотрудникиПользователей.Пользователь = &Пользователь
		|	|	И Сотрудники.Ссылка <> СотрудникиПользователей.Сотрудник
		|	|	И Сотрудники.Действует"";
		|Запрос.УстановитьПараметр(""Пользователь"", Параметры.Пользователь);
		|
		|Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);";

	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "ВсеПодчиненныеСотрудника";
	Стр.КлючДляВызова = "ВсеПодчиненныеСотрудника";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Сотрудник"") Тогда
		|    ВызватьИсключение(
		|        НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Сотрудник""""'""));
		|КонецЕсли;
		|	
		|Запрос = Новый Запрос;
		|Запрос.Текст = 
		|	""ВЫБРАТЬ
		|	|	Сотрудники.Ссылка КАК Сотрудник
		|	|ИЗ
		|	|	Справочник.Сотрудники КАК Сотрудники
		|	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодчиненностьПодразделений КАК ПодчиненностьПодразделений
		|	|		ПО Сотрудники.Подразделение = ПодчиненностьПодразделений.Подчиненное
		|	|ГДЕ
		|	|	ПодчиненностьПодразделений.РуководительВышестоящего = &Сотрудник
		|	|	И Сотрудники.Ссылка <> &Сотрудник
		|	|	И Сотрудники.Действует"";
		|Запрос.УстановитьПараметр(""Сотрудник"", Параметры.Сотрудник);
		|
		|Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);";

	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "ВсеКоллегиСотрудника";
	Стр.КлючДляВызова = "ВсеКоллегиСотрудника";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Сотрудник"") Тогда
		|    ВызватьИсключение(
		|        НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Сотрудник""""'""));
		|КонецЕсли;
		|
		|Результат = Новый Массив;
		|Сотрудник = Параметры.Сотрудник;
		|Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, ""Подразделение"");
		|
		|Если ЗначениеЗаполнено(Подразделение) Тогда
		|	Запрос = Новый Запрос;
		|	Запрос.Текст = 
		|		""ВЫБРАТЬ
		|		|	Сотрудники.Ссылка КАК Сотрудник
		|		|ИЗ
		|		|	Справочник.Сотрудники КАК Сотрудники
		|		|ГДЕ
		|		|	Сотрудники.Подразделение = &Подразделение
		|		|	И Сотрудники.Ссылка <> &Сотрудник
		|		|	И Сотрудники.Действует"";
		|	Запрос.УстановитьПараметр(""Сотрудник"", Сотрудник);
		|	Запрос.УстановитьПараметр(""Подразделение"", Подразделение);
		|	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
		|	
		|	РуководительПодразделения = СтруктураПредприятия.РуководительПодразделения(Подразделение);
		|	Если Результат.Найти(РуководительПодразделения) = Неопределено Тогда
		|		Результат.Добавить(РуководительПодразделения);
		|	КонецЕсли;
		|
		|КонецЕсли;";
	
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "РуководителиПодразделений";
	Стр.КлючДляВызова = "РуководителиПодразделений";
	Стр.Выражение = 
		"Результат = Новый Массив;
		|Запрос = Новый Запрос;
		|Запрос.Текст = 
		|	""ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	|	Сотрудники.Ссылка КАК Ссылка
		|	|ИЗ
		|	|	Справочник.Сотрудники КАК Сотрудники
		|	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|	|		ПО (Сотрудники.Ссылка = СтруктураПредприятия.Руководитель)
		|	|ГДЕ
		|	|	Сотрудники.Действует
		|	|	И НЕ Сотрудники.ПометкаУдаления"";
		|Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
		|
		|";
		
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "ВсеВизыДокумента";
	Стр.КлючДляВызова = "ВсеВизыДокумента";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|	ВызватьИсключение(СтрШаблон(
		|		НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|		ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Документ"") Тогда
		|	ВызватьИсключение(
		|		НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Документ""""'""));
		|КонецЕсли;
		|
		|ТолькоАктивные = Истина;
		|Если Параметры.Свойство(""ТолькоАктивные"") Тогда
		|	ТолькоАктивные = Параметры.ТолькоАктивные;
		|КонецЕсли;
		|
		|Документ = Параметры.Документ;
		|Результат = РаботаСВизамиСогласования.ПолучитьВизыДокумента(Документ, ТолькоАктивные);";
		
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "СвязанныйОбъект";
	Стр.КлючДляВызова = "СвязанныйОбъект";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|	ВызватьИсключение(СтрШаблон(
		|		НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|		ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Объект"") Тогда
		|	ВызватьИсключение(
		|		НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Объект""""'""));
		|КонецЕсли;
		|Если Не Параметры.Свойство(""ТипСвязи"") Тогда
		|	ВызватьИсключение(
		|		НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"ТипСвязи""""'""));
		|КонецЕсли;
		|
		|Результат = СвязиОбъектов.ПолучитьСвязанныйОбъект(Параметры.Объект, Параметры.ТипСвязи);";
		
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "ВсеСвязанныеОбъекты";
	Стр.КлючДляВызова = "ВсеСвязанныеОбъекты";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|	ВызватьИсключение(СтрШаблон(
		|		НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|		ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""Объект"") Тогда
		|	ВызватьИсключение(
		|		НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"Объект""""'""));
		|КонецЕсли
		|
		|Результат = СвязиОбъектов.ПолучитьВсеСвязиОбъекта(Параметры.Объект);";
		
	Для Каждого Стр Из ТаблицаЭлементов Цикл
		Попытка
			АлгоритмСсылка = Справочники.Алгоритмы[Стр.ИмяПредопределенного];
			АлгоритмОбъект = АлгоритмСсылка.ПолучитьОбъект();
			Если АлгоритмОбъект.Выражение <> Стр.Выражение
				Или АлгоритмОбъект.КлючДляВызова <> Стр.КлючДляВызова Тогда
				АлгоритмОбъект.Выражение = Стр.Выражение;
				АлгоритмОбъект.КлючДляВызова = Стр.КлючДляВызова;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(АлгоритмОбъект);
			КонецЕсли;
		Исключение
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Ошибка при обновлении предопределенного алгоритма ""%1"": %2'"),
				Стр.ИмяПредопределенного,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				"Алгоритмы",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.Алгоритмы,,
				ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеАлгоритмаПоКлючу(КлючДляВызова)
	
	ДанныеАлгоритма = Новый Структура("Ссылка, Выражение", Неопределено, "");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Алгоритмы.Ссылка КАК Ссылка,
		|	Алгоритмы.Выражение
		|ИЗ
		|	Справочник.Алгоритмы КАК Алгоритмы
		|ГДЕ
		|	Алгоритмы.КлючДляВызова = &КлючДляВызова
		|	И НЕ Алгоритмы.ПометкаУдаления");
	Запрос.УстановитьПараметр("КлючДляВызова", КлючДляВызова);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеАлгоритма.Ссылка = Выборка.Ссылка;
		ДанныеАлгоритма.Выражение = Выборка.Выражение;
	КонецЕсли;
	
	Возврат ДанныеАлгоритма;
	
КонецФункции

#КонецОбласти

#КонецЕсли
